[
    {
        "id": 1,
        "ktype": "시바견",
        "etype": "Shiba Inu",
        "kdesc": "당신은 한번 시작한 일은 끝까지 해내며, 책임감이 강하고 현실적이며 매사에 철저해요. 원리원칙이 중요하고 깔끔해요. 즉흥적으로 움직이기보단 계획적으로 척척! 혼자 있는게 편하고 다른사람이 터치하는거 싫어요. 가끔은 자기중심적이기도 하고, 스케줄에 방해받는거 너무 싫어해요! ",
        "edesc": "Once you start, you do it until the end, you are responsible, realistic, and thorough in everything. The principle is very important to you also you are neat. You prefer plan it out Instead of improvising. It's comfortable to be alone and you don't want anyone else to touch you. Sometimes you're self-centred, and you hate being disturbed your schedules by others.",
        "mbti": "ISTJ",
        "reimg": "./images/pp1.png",
        "goodfrk": "슈나우저",
        "goodfre": "Schnauzer",
        "goodpp": "./images/pt8.png",
        "badfrk": "웰시코기",
        "badfre": "Welsh Corgi",
        "badpp": "./images/pt18.png"
    },
    {
        "id": 2,
        "ktype":"달마시안",
        "etype":"Dalmatian",
        "kdesc":"당신은 과묵하고 분석적이며 어떤 상황에서도 적응력이 뛰어나요. 집에서도 효율적인 일만 찾아서 해요. 드라마 끝까지 보는거 잘 못해요. 누가 내 생활방식이나 일에 간섭하는거 정말 싫어해요.  ",
        "edesc":"You are taciturn, analytical, and adaptable in any situation. You only find efficient things at home. You're not good at watching dramas until the end. You really hate when someone interferes with your lifestyle or work.",
        "mbti":"ISTP",
        "reimg": "./images/pp14.png",
        "goodfrk": "래브라도",
        "goodfre": "Labrador",
        "goodpp": "./images/pt9.png",
        "badfrk": "푸들",
        "badfre": "Poodle",
        "badpp": "./images/pt6.png"
    },
    {
        "id": 3, 
        "ktype":"퍼그", 
        "etype":"Pug", 
        "kdesc":"당신은 노는건 좋아하는데 나가는게 너무 귀찮아요! 근데 막상 나가면 세상 누구보다 제일 잘 놀아요. 손재주가 좋아서 이것저것 만드는거 잘하고 좋아해요. 느긋하고 관용적이며 타협을 좋아해요. 현실적 문제 해결에 능숙해요 ",
        "edesc":"You like to play, but it's so annoying to go out! But when you go out, you play the best than anyone else in the world. You are good at doing this and that because you are good at making things. You are relaxed, tolerant, and likes compromise. You're good at solving practical problems.",
        "mbti":"ESTP",
        "reimg": "./images/pp4.png",
        "goodfrk": "시바견",
        "goodfre": "Shiba Inu",
        "goodpp": "./images/pt1.png",
        "badfrk": "치와와",
        "badfre": "Chihuahua",
        "badpp": "./images/pt5.png"
    },
    {
        "id": 4, 
        "ktype":"미니어쳐 핀셔", 
        "etype":"Miniature Pinscher", 
        "kdesc":"당신은 친구 운동 음식등 다양함을 선호해요. 체계적이며 규칙을 준수하고 사실적 목표설정에 능해요. 일이든 생활이든 계획적으로 딱딱 맞는걸 좋아해요. 나가서 노는것도 좋지만 뭔가를 배우는게 더 좋아요. 애매한거 싫어하고 뭐든 확실한걸 좋아해요. ",
        "edesc":"You prefer diversity, such as friends, exercise, and food. It is systematic, complies with the rules, and is good at setting realistic goals. Whether it's work or life, You like to fit in with the plans. It's good to go out and play, but it's better to learn something. You don't like ambiguous things and you like certain things.",
        "mbti":"ESTJ",
        "reimg": "./images/pp10.png",
        "goodfrk": "치와와",
        "goodfre": "Chihuahua",
        "goodpp": "./images/pt5.png",
        "badfrk": "비글",
        "badfre": "Beagle",
        "badpp": "./images/pt12.png"
    },
    {
        "id": 5, 
        "ktype":"골든리트리버", 
        "etype":"Golden Retriever", 
        "kdesc":"당신은 성실하고 온화하고 협조를 잘해요. 차분하고 헌신적이며 인내심 강하죠 또한 타인의 감정변화에 주의를 기울일줄 알아요. 혼자 영화보거나 혼자 밥먹는것도 좋아해지만 친구들과 어울리는것도 좋아해요. 새로운 것 보다는 익숙한걸 더 선호해요. 조금 게으르긴 하지만 한번 시작하면 완벽하게 해내야 직성이 풀려요.",
        "edesc":"You are sincere, gentle, and good at cooperating. You're calm, devoted, and patient. You also know how to pay attention to other people's emotional changes. You like watching movies alone or eating alone, but you also like hanging out with my friends. You prefer familiar things to new things. You are a little lazy, but once You start, You have to do it perfectly to feel comfortable.",
        "mbti":"ISFJ",
        "reimg": "./images/pp2.png",
        "goodfrk": "잭 러셀 테리어",
        "goodfre": "Jack Russell Terrier",
        "goodpp": "./images/pt17.png",
        "badfrk": "보스턴 테리어",
        "badfre": "Boston Terrier",
        "badpp": "./images/pt15.png"
    },
    {
        "id": 6, 
        "ktype":"도베르만", 
        "etype":"Doberman", 
        "kdesc":"당신은 온화하고 겸손하며 삶의 여유를 느끼는걸 좋아해요. 귀차니즘이 있어서 집안일 잘 안하지만 한번 하면 제대로 해요. 집에 가면 연락이 잘 안돼요. 밖에서 노는거 좋아하지만 금방 지쳐요. 갈등과 불화를 싫어하고 남의 눈치를 많이 봐요. ",
        "edesc":"You like to be gentle, humble, and relaxed in your life. You don't do housework often because You are lazy, but once You do it, You do it properly. You can't get in touch well when you go home. You like to play outside, but you get tired quickly. You hate conflict and discord and is wary of others a lot.",
        "mbti":"ISFP",
        "reimg": "./images/pp3.png",
        "goodfrk": "웰시코기",
        "goodfre": "Welsh Corgi",
        "goodpp": "./images/pt18.png",
        "badfrk": "슈나우저",
        "badfre": "Schnauzer",
        "badpp": "./images/pt8.png"
    },
    {
        "id": 7, 
        "ktype":"스피츠", 
        "etype":"Japanese Spitz", 
        "kdesc":"당신은 호기심이 많으며 개방적이에요! 하고싶은건 바로바로 하고 하기 싫은건 끝까지 미뤄요. 우주최강 오지라퍼! 주변사람들에게 관심이 엄청 많아요. 친구들하고 노는거 너무 좋아해요 근데 놀고나서 치우는건 너무 싫어요! ",
        "edesc":"You are curious and open-minded! Do what you want to do right away, and postpone what you don't want to do until the end. The most nosy person in the universe. You're very interested in people around you. You love hanging out with your friends. But you hate cleaning up after playing!",
        "mbti":"ESFP",
        "reimg": "./images/pp11.png",
        "goodfrk": "불테리어",
        "goodfre": "Bull Terrier",
        "goodpp": "./images/pt13.png",
        "badfrk": "잭 러셀 테리어",
        "badfre": "Jack Russell Terrier",
        "badpp": "./images/pt17.png"
    },
    {
        "id": 8, 
        "ktype":"래브라도", 
        "etype":"Labrador", 
        "kdesc":"당신은 상냥하고 다른 사람들을 도와주며 어울리는 것을 좋아해요. 사람에 대한 관심이 많고 친절하고 동정심도 많아요. 그래서 별 일이 없어도 주변 사람들에 자주 연락하고 잘 챙겨요! 그래서 친절하다는 말을 자주 듣고 또한 에티켓도 잘 지켜요. ",
        "edesc":"You are sweet and like to help others and hang out. You have a lot of interest in people, kind, and sympathetic. So even if nothing happens, You contact people around you often and take care of them! So you often hear that you're kind and you also follow etiquette well.",
        "mbti":"ESFJ",
        "reimg": "./images/pp9.png",
        "goodfrk": "달마시안",
        "goodfre": "Dalmatian",
        "goodpp": "./images/pt14.png",
        "badfrk": "시바견",
        "badfre": "Shiba Inu",
        "badpp": "./images/pt1.png"
    },
    {
        "id": 9, 
        "ktype":"불테리어", 
        "etype":"Bull Terrier", 
        "kdesc":"당신은 완벽주의자에요! 항상 깔끔하며 주변 정리를 잘해요. 높은 통찰력으로 다른 사람들에게 영감을 줄때가 많아요. 결정을 내릴때 굉장히 신중하고 고민하는 편이에요. 부지런하고 할일을 바로바로 하는 타입이지만 한번에 여러가지는 못해요. 다른 사람이 어려움을 겪고있으면 도와주고싶어해요.",
        "edesc":"You're a perfectionist! It's always neat and tidy. High insight often inspires others. You tend to be very careful and think hard when making decisions. You're diligent and do things right away, but you can't do many things at once. If someone else is having a hard time, you want to help them.",
        "mbti":"INFJ",
        "reimg": "./images/pp13.png",
        "goodfrk": "퍼그",
        "goodfre": "Pug",
        "goodpp": "./images/pt4.png",
        "badfrk": "미니어쳐 핀셔",
        "badfre": "Miniature Pinscher",
        "badpp": "./images/pt10.png"
    },
    {
        "id": 10, 
        "ktype":"치와와", 
        "etype":"Chihuahua", 
        "kdesc":"당신은 혼자 있는걸 좋아하지만 은근 외로움도 많이타고 외로운거 싫어해요. 집밖에 나가는거 싫어해요. 낯을 많이 가리고 여러명과 어울리는 것보다 한 두명하고만 노는게 좋아요. 눈치가 빠르고 고집도 쎈 편이에요. 다른 사람에게 민폐 끼치는거 극도로 싫어해요! ",
        "edesc":"You like to be alone, but you feel lonely easily and also don't like to be lonely. You don't like going outside the house. You are shy. It's better to play with only one or two people than hang out with several people. You're quick-witted and stubborn. You really hate being a nuisance to others!",
        "mbti":"INFP",
        "reimg": "./images/pp5.png",
        "goodfrk": "웰시코기",
        "goodfre": "Welsh Corgi",
        "goodpp": "./images/pt18.png",
        "badfrk": "불테리어",
        "badfre": "Bull Terrier",
        "badpp": "./images/pt13.png"
    },
    {
        "id": 11, 
        "ktype":"푸들", 
        "etype":"Poodle", 
        "kdesc":"당신은 흥미가 생기는 것에 완전 열정적으로 대해요! 핫한건 무조건 해야해요. 하지만 흥미없는건 관심없어요. 평소엔 잘 돌아다니는데 나만의 시간을 갖고싶을땐 집에서 안나와요. 새 관계를 만드는걸 좋아해요. 상상력이 풍부하고 순발력 뛰어나요. 일상적인 활동에 지루함 자주느껴요.",
        "edesc":"You're totally passionate about getting interested! You have to do something catches on no matter what. But you're not interested in things you are not interested in. You usually go around well, but you don't come out of your house when you want to have you own time. You like to build new relationships. You are imaginative and quick-witted. You often feel bored with your daily activities.",
        "mbti":"ENFP",
        "reimg": "./images/pp6.png",
        "goodfrk": "골든리트리버",
        "goodfre": "Golden Retriever",
        "goodpp": "./images/pt2.png",
        "badfrk": "스피츠",
        "badfre": "Japanese Spitz",
        "badpp": "./images/pt11.png"
    },
    {
        "id": 12, 
        "ktype":"비글", 
        "etype":"Beagle", 
        "kdesc":"당신은 사교적이며 타인을 존중해요. 비판을 받으면 예민하게 반응해요. 무리에 속해있는것도 좋지만 마이웨이 기질도 약간 있어요. 사람 자체를 좋아해요 친구들을 집에 데려오는 것도 좋아하고 한번 놀면 시끄럽게 잘 놀아요. 스스로를 잘 알고 있으며 당장 뭘 해야할지에 대한 상황판단도 상당히 빨라요. ",
        "edesc":"You are sociable and respectful of others. You react sensitively when you're criticized. It's good to be part of the group, but you also have a little bit of your way temperament. You like people themselves. You like to bring your friends home, and once you play, you play loudly. You know you well and makes very quick judgments about what to do right away.",
        "mbti":"ENFJ",
        "reimg": "./images/pp12.png",
        "goodfrk": "잭 러셀 테리어",
        "goodfre": "Jack Russell Terrier",
        "goodpp": "./images/pt17.png",
        "badfrk": "미니어쳐 핀셔",
        "badfre": "Miniature Pinscher",
        "badpp": "./images/pt10.png"
    },
    {
        "id": 13, 
        "ktype":"보스턴 테리어", 
        "etype":"Boston Terrier", 
        "kdesc":"당신은 혼자있는걸 좋아하고 자기만의 시간을 가지는걸 좋아해요! 정신사납고 시끄러운거 너무 싫어요. 돈 관리도 잘하고 의미 없는 지출은 잘 안해서 돈도 잘 모아요. 몇몇 물건에 애착이 강하며 잘 못 버려요. 하루 계획을 철저히 짜고 지키며 사는거 좋아해요. 의지가 강하며 독립적이고 분석력이 뛰어나요. ",
        "edesc":"You like to be alone and have your own time! You hate being distracted and noisy. You manage your money well and don't spend meaningless money, so you save money well. You're attached to some things and you're not good at throwing them away. You like to make and keep your daily plans thoroughly. You have a strong will, is independent, and has excellent analytical power.",
        "mbti":"INTJ",
        "reimg": "./images/pp15.png",
        "goodfrk": "스피츠",
        "goodfre": "Japanese Spitz",
        "goodpp": "./images/pt11.png",
        "badfrk": "래브라도",
        "badfre": "Labrador",
        "badpp": "./images/pt9.png"
    },
    {
        "id": 14, 
        "ktype":"잭 러셀 테리어", 
        "etype":"Jack Russell Terrier", 
        "kdesc":"당신은 미루기 끝판왕이에요. 게으르지만 머리는 좋아요. 다른 사람들에게 피해주는거 싫어하고 또 남들에게 별로 관심도 없어요. 자기 주관이 뚜렷하고 호불호가 확실해요. 평범한걸 싫어하고 그것에 대해 자부심도 있어요. 친한 친구라도 별 일이 없으면 연락 안해요. 지적호기심이 상당히 높아요! ",
        "edesc":"You're the best procrastinator. You're lazy, but You're smart. You don't like to harm others also actually you're not interested in others. You have a clear subjectivity and likes and dislikes. You don't like ordinary things and You're proud of it. Even a close friend doesn't contact you if nothing happens. You have a lot of intellectual curiosity!",
        "mbti":"INTP",
        "reimg": "./images/pp17.png",
        "goodfrk": "비글",
        "goodfre": "Beagle",
        "goodpp": "./images/pt12.png",
        "badfrk": "스피츠",
        "badfre": "Japanese Spitz",
        "badpp": "./images/pt11.png"
    },
    {
        "id": 15, 
        "ktype":"슈나우저", 
        "etype":"Schnauzer", 
        "kdesc":"당신은 풍부한 상상력으로 끊임없이 새로운것에 도전하는걸 좋아해요. 집안에 있는것도 좋지만 주기적으로 밖에 나가줘야해요. 3일 이상 못버텨요! 모험심이 강하고 임기응변이 뛰어나서 무슨 일이 있어도 혼자 뚝딱뚝딱 잘 해결해요. ",
        "edesc":"You like to constantly challenge new things with rich imagination. It's good to stay at home, but you have to go out regularly, You can't last more than 3 days! You are adventurous and good at adapting to situations, so you solve them well by yourself no matter what.",
        "mbti":"ENTP",
        "reimg": "./images/pp8.png",
        "goodfrk": "골든리트리버",
        "goodfre": "Golden Retriever",
        "goodpp": "./images/pt2.png",
        "badfrk": "도베르만",
        "badfre": "Doberman",
        "badpp": "./images/pt3.png"
    },
    {
        "id": 16, 
        "ktype":"웰시코기", 
        "etype":"Welsh Corgi", 
        "kdesc":"당신은 다른 사람을 활력적으로 인도해요. 효율적이고 철저한 준비를 하며 활동적이고 통솔력있고 단호한 면도 있어요. 남에게 잘 의존하지 않으며 거의 모든 일을 혼자 처리해요. 남에게 피해주는것도 싫지만 피해를 입는것도 극도로 싫어해요. 니 일 내 일 칼같이 나누는 편이에요. ",
        "edesc":"You lead others vigorously. You prepare efficiently and thoroughly, is active, have leadership and determination. You don't rely on others well and handle almost everything alone. You don't like to harm others, but you also hate to be damaged. You tend to accurately divide your work and other people's.",
        "mbti":"ENTJ",
        "reimg": "./images/pp18.png",
        "goodfrk": "치와와",
        "goodfre": "Chihuahua",
        "goodpp": "./images/pt5.png",
        "badfrk": "골든리트리버",
        "badfre": "Golden Retriever",
        "badpp": "./images/pt2.png"
    }
]